export let valuesUpTo9 = {
    1: "один",
    2: "два",
    3: "три",
    4: "четыре",
    5: "пять",
    6: "шесть",
    7: "семь",
    8: "восемь",
    9: "девять"
}

export let valuesFrom10To19 = {
    10: "десять",
    11: "одиннадцать",
    12: "двенадцать",
    13: " тринадцать",
    14: "четырнадцать",
    15: "пятнадцать",
    16: "шестнадцать",
    17: "семнадцать",
    18: "восемнадцать",
    19: "девятнадцать"
}
export let dozens = {
    20: "двадцать",
    30: "тридцать",
    40: "сорок",
    50: "пятьдесят",
    60: "шестьдесят",
    70: "семьдесят",
    80: "восемьдесят",
    90: "девяносто"
}

export let hundreds = {
    100: "сто",
    200: "двести",
    300: "триста",
    400: "четыреста",
    500: "пятьсот",
    600: "шестьсот",
    700: "семьсот",
    800: "восемьсот",
    900: "девятьсот",
}

/*
let concat = (value: string) => {
    let numberValue = +value
    if(numberValue){
        if(numberValue > 9 && numberValue < 20){
           // @ts-ignore
            return  `${dozens[value[0]]} ${digitsUpTo9[value[1]]}`
        }
    }
}*/
